
---- Вставка продуктов с указанием is_new = false и игнорированием конфликтов
INSERT INTO public.client (id, name, second_name, email, phone, card)
VALUES (3, 'Маргарита', '500', 'Пицца перони', 'false','api/image/1')
ON CONFLICT (id) DO NOTHING;


INSERT INTO public.material (id, title, count, price)
VALUES
    (1, 'Материал 1', 100, 50),
    (2, 'Материал 2', 200, 75),
    (3, 'Материал 3', 150, 60),
    (4, 'Материал 4', 120, 40),
    (5, 'Материал 5', 80, 30),
    (6, 'Материал 6', 300, 90),
    (7, 'Материал 7', 250, 100),
    (8, 'Материал 8', 50, 20),
    (9, 'Материал 9', 180, 55),
    (10, 'Материал 10', 400, 150)
ON CONFLICT (id) DO NOTHING;


INSERT INTO public.product (id, title, materials, price)
VALUES
    (1, 'Стол из дуба', ARRAY[1, 2, 3], 15000),
    (2, 'Шкаф-купе', ARRAY[4, 5, 6], 25000),
    (3, 'Кровать двуспальная', ARRAY[7, 8, 9], 20000),
    (4, 'Стул офисный', ARRAY[10, 1], 5000),
    (5, 'Письменный стол', ARRAY[2, 3, 4], 12000),
    (6, 'Кухонный гарнитур', ARRAY[5, 6, 7], 45000),
    (7, 'Диван угловой', ARRAY[8, 9, 10], 30000),
    (8, 'Кресло мягкое', ARRAY[1, 2], 10000),
    (9, 'Полка настенная', ARRAY[3], 3000),
    (10, 'Тумба прикроватная', ARRAY[4, 5], 7000)
ON CONFLICT (id) DO NOTHING;



